// 보계 카테고리 공지 데이터
const noticeData_보계 = [
    {
        category: '보계',
        title: '보계의 의미와 어디서 구입하는지를 알고 싶어요!',
        date: '2025.06.17',
        content: [
            '보계: 쉽게 말해 서버의 유료재화인 무지개보석이 4000개이상 존재하는 계정을 말합니다.',
            '해당 계정의 구입처는 헝그리앱의 원피스트레저크루즈에서 구입가능합니다.',
            // 헝그리앱 바로가기를 a 태그로 링크 처리
            '<a href="https://www.hungryapp.co.kr/" target="_blank" style="color:#257cff;text-decoration:underline;">헝그리앱 바로가기</a>'
        ].join('<br>')
    },

    {
        category: '보계',
        title: '보계는 언제 구입하면 될까요?',
        date: '2025.06.17',
        content: [
            '출항기간을 참고해서 해당 기간에 구입해서 출항하시면 됩니다.',
            '원트크에는 초스고페스, 주년스고페스가 있는데 해당 스고페스 기간에 출항하시는게 베스트입니다.',
            '초스고패스: 해당 페스에만 등장하는 한정 초스고캐릭터가 등장함',
            '주년스고패스: 해당 페스에만 등장하는 한정 주년캐릭터가 등장함',
        ].join('<br>')
    },

    {
        category: '보계',
        title: '보석은 얼마나 남겨야 될까요?',
        date: '2025.06.17',
        content: [
            '기본적으로는 최소 2000개 이상 남겨두시고 여유롭게 출항하시는게 베스트입니다.',
            '이유로는 추후 캐릭터 뽑기에 대비하기 위해서 입니다',
        ].join('<br>')
    },

    {
        category: '보계',
        title: '어떤 캐릭터를 뽑아야하나요?',
        date: '2025.06.17',
        content: [
            '무조건적으로 뽑아야하는 캐릭터는 없습니다.',
            '매번 페스마다 뽑을 수 있는 캐릭터도 달라지기 때문에 출항기간에',
            '원트크 갤러리에서 질문하시길 바랍니다.',
            '<a href="https://gall.dcinside.com/mgallery/board/lists/?id=onepiecetc" target="_blank" style="color:#257cff;text-decoration:underline;">원트크갤 바로가기</a>'
        ].join('<br>')
    },

    {
        category: '보계',
        title: '보계 구입시 주의점이 있나요?',
        date: '2025.06.17',
        content: [
            '원트크는 OS끼리 친화적이기 때문에 다른 OS끼리 계정을 옮길시 보석이 사라집니다.',
            '예를 들어 안드로이드 -> 안드로이드 또는 IOS -> IOS는 가능한데',
            '안드로이드 <-> IOS끼리 옮기는건 불가능합니다',
            '해당 점을 참고하여 자신에 맞는 OS기종의 보계를 구입하길 바랍니다.',
        ].join('<br>')
    },

    {
        category: '보계',
        title: '게임 시작시 주는 무료 뽑기나 리세로는 게임이 불가능하나요?',
        date: '2025.06.17',
        content: [
            '현실적으로 말하면 불가능합니다',
            '해당 이유로는 1달간 출시되는 캐릭터 수도 많고',
            '소수의 캐릭터로는 게임플레이에 지장이 가기 때문입니다',
        ].join('<br>')
    },
]; 